[
    {
        "id": "1",
        "name": "Razer DeathAdder V3 PRO",
        "brand": "Razer",
        "src": "images/products/0/thumbnail.webp",
        "description": "With the Razer DeathAdder V3 Pro, you get the speed and control you need to take your game to the next level. This ergonomic mouse is 25% lighter than its predecessor, making it one of the lightest esports mice ever created. It's also been refined and redesigned with the help of top esports professionals, so you can trust it to stand up to the rigors of competition.",
        "type": "Wireless",
        "price": "159"
    },
    {
        "id": "2",
        "name": "Pulsar X2V2 Mini",
        "brand": "Pulsar",
        "src": "images/products/1/thumbnail.webp",
        "description": "Old, but new! Pulsar introduces the X2V2, the gaming mouse with a familiar, ultra-comfortable shape for both casual claw and palm/claw grip users. Its revamped internals have been perfected by learning from the previous version, ensuring a stable shell and consistent, satisfying clicks. The new indirect wheel structure with precision ball bearings ensures smooth rotations and quick clicks. Take your gaming to a new level with X2V2.",
        "type": "Wireless",
        "price": "109.95"
    },
    {
        "id": "3",
        "name": "Pulsar X2V2",
        "brand": "Pulsar",
        "src": "images/products/2/thumbnail.webp",
        "description": "Old, but new! Pulsar introduces the X2V2, the gaming mouse with a familiar, ultra-comfortable shape for both casual claw and palm/claw grip users. Its revamped internals have been perfected by learning from the previous version, ensuring a stable shell and consistent, satisfying clicks. The new indirect wheel structure with precision ball bearings ensures smooth rotations and quick clicks. Take your gaming to a new level with X2V2.",
        "type": "Wireless",
        "price": "109.95"
    },
    {
        "id": "4",
        "name": "Logitech G PRO X Superlight",
        "brand": "Logitech",
        "src": "images/products/3/thumbnail.webp",
        "description": "With hyper-minimal redesign, Pro X is Logitech's lightest and fastest mouse ever weighing in at under 63 grams. Almost 25% lighter than it's predecessor. Also with Lightspeed, the next-gen, pro-grade wireless technology that has even more responsive connectivity. The finishing touch are the PTFE Feet that gives an incredibly smooth glide.",
        "type": "Wireless",
        "price": "139.90"
    },
    {
        "id": "5",
        "name": "Logitech G PRO X Superlight 2",
        "brand": "Logitech",
        "src": "images/products/4/thumbnail.webp",
        "description": "The most anticipated gaming mouse of the year is here! The Logitech G Pro X Superlight 2 4K is the successor to one of the most popular gaming mice of all time. Logitech has chosen to keep its award-winning design from its predecessor and apply it to the new GPX Superlight 2. The GPX Superlight 2 features its own Hero 2 sensor, which is one of the most advanced optical sensors in gaming. Hero 2 enables a polling rate of 4000 Hz (0.5 ms), which provides unparalleled performance when shooting down opponents.",
        "type": "Wireless",
        "price": "169"
    },
    {
        "id": "6",
        "name": "VXE R1 Pro Max Wireless Gaming Mouse",
        "brand": "VGN",
        "src": "images/products/5/thumbnail.webp",
        "description": "Now the new series of VGN Dragonfly R1 has been launched. These mice are ultralight and have a comfortable grip. The R1 Pro Max has the PAW3395 which provides an incredibly smooth tracking of 650 IPS and up to 26000 DPI. Perfect for playing a long gaming session with SmartSpeed high-speed wireless communication. Experience 4K Hz (4K Dongle purchased separately) and up to 150h battery time (1000Hz).",
        "type": "Wireless",
        "price": "56.99"
    },
    {
        "id": "7",
        "name": "Model O 2 Wired Gaming Mouse - Matte Black",
        "brand": "Glorious",
        "src": "images/products/6/thumbnail.webp",
        "description": "Glorious finally comes with a successor to the beloved Model O gaming mouse. Model O 2 weighs only 59 grams and is an ultralight mouse upgraded with advanced features. With pixel-perfect tracking, frictionless feet, and a weightless cable, you'll perform at the highest level with ease. Of course, the new model retains the iconic symmetrical shape that has become standard among players worldwide for its comfort and precision.",
        "type": "Wired",
        "price": "84.90"
    },
    {
        "id": "8",
        "name": "Model O Gaming Mouse Black",
        "brand": "Glorious",
        "src": "images/products/7/thumbnail.webp",
        "description": "Model O’s Honeycomb Shell is the key to achieving a feather-light weight while maintaining its ultra-durable strength. You’ll barely feel the holes during gameplay, but they provide ventilation to keep your palms cool & fresh. Cleaning the Model O is easy, just use any air canister to keep your mouse good as new.",
        "type": "Wired",
        "price": "59.90"
    },
    {
        "id": "9",
        "name": "Razer Viper V2 Pro",
        "brand": "Razer",
        "src": "images/products/8/thumbnail.webp",
        "description": "The Viper V2 PRO from Razer is the successor to the award-winning Razer Viper Ultimate. It is one of the lightest wireless gaming mice ever, and it has been upgraded in all respects for increased performance. The Razer Optical Mouse Switch Gen-3 provides no double-click problems and no debounce delay.",
        "type": "Wireless",
        "price": "133.90"
    },
    {
        "id": "10",
        "name": "Dragonfly F1 MOBA Wireless Gaming Mouse - Black",
        "brand": "VGN",
        "src": "images/products/9/thumbnail.webp",
        "description": "The brand-new Dragonfly F1 family of ultra-lightweight mice is now available. These mice include a pleasant grip, incredibly smooth tracking, long battery life, and SmartSpeed high-speed wireless communication.",
        "type": "Wireless",
        "price": "69.99"
    }
]